Autodesk.Revit.DB.SymbolicCurve.Subcategory
The subcategory.
Remarks: If the family category is non-cuttable, the subcategory can be
set to be the family category or one of its subcategories.
If the family category is cuttable, the subcategory can be set as the graphics
styles of the family category, its subcategories, or the invisible lines graphics style.

Autodesk.Revit.DB.SymbolicCurve.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the symbolic curve.
Remarks: The visibility of the symbolic curve geometry can be changed for different detail levels.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when visibility is not valid for symbolic curves.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.SymbolicCurve.GetVisibility
Gets the visibility for the symbolic curve.
Returns: A copy of visibility settings for the symbolic curve.

Autodesk.Revit.DB.SymbolicCurve.ReferenceType
Indicates the type of reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when argument is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.SymbolicCurve.IsDrawnInForeground
Indicates if this curve will be drawn in the foreground of the family instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.
Thrown when the value for this property cannot be changed.

Autodesk.Revit.DB.SymbolicCurve
A curve that provides information but is not intended to represent actual geometry in an element.
Remarks: For example, when creating a door family, you might sketch symbolic lines in an elevation view to represent a door swing.
Symbolic curves are visible parallel to the view in which you sketch them.